Tekla Open API Reference for Tekla Structures 2025
TeklaProgressBar Constructor
Initializes the common progress bar control.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TeklaProgressBar(
	string text = "albl_Processing_Please_wait..."
)
Public Sub New (
	Optional text As String = "albl_Processing_Please_wait..."
)
Parameters
text (Optional)
Type: System.String
The message to display in the control.
See Also
Reference
TeklaProgressBar Class
Tekla.Structures.Dialog Namespace